In [1]:
#setting range
for i in range(0,100):
    print(i,end=",")

0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,

In [2]:
#range start, stop, step by(can be a table or addition n all)
for i in range(0, 100, 7): 
     print(i,end=",")

0,7,14,21,28,35,42,49,56,63,70,77,84,91,98,

In [3]:
#only even number or 2 table
for i in range(2, 100, 2):
    print(i,end=",")

2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60,62,64,66,68,70,72,74,76,78,80,82,84,86,88,90,92,94,96,98,

In [4]:
#sum of each number till 100
n=100
sum = 0
for counter in range(1,n+1):
    sum = sum + counter
sum

5050

In [5]:
import pandas as pd
import numpy as np

In [6]:
#making and combining array
a = np.array([1,2,3,4,5,6,7,8,9,10])
b = np.array([11,12,13,14,15,16,17,18,19,20])
x = pd.DataFrame(b,a)

In [7]:
print(x)

     0
1   11
2   12
3   13
4   14
5   15
6   16
7   17
8   18
9   19
10  20

In [8]:
#shifting by the value of 2
y = x.shift(2)

In [9]:
print(y)

       0
1    NaN
2    NaN
3   11.0
4   12.0
5   13.0
6   14.0
7   15.0
8   16.0
9   17.0
10  18.0

In [10]:
#screenout only odd
print(x[::2])

    0
1  11
3  13
5  15
7  17
9  19

In [11]:
#screenout only even
print(x[1::2])

     0
2   12
4   14
6   16
8   18
10  20

In [12]:
#diffrencing
diff = x-x.shift(1)
print(diff)

      0
1   NaN
2   1.0
3   1.0
4   1.0
5   1.0
6   1.0
7   1.0
8   1.0
9   1.0
10  1.0

In [13]:
table1 = pd.DataFrame({'A': ['c', 'c', 'c', 'j', 'k', 'l', 'l', 'x', 'z'],
                       'b': [1, 2, 5, 2, 3, 3, 4, 2, 1]})
table1

   A  b
0  c  1
1  c  2
2  c  5
3  j  2
4  k  3
5  l  3
6  l  4
7  x  2
8  z  1

In [14]:
table2 = pd.DataFrame({'A': ['c', 'c', 'd', 'd', 'l', 'x', 'x', 'r'],
                       'b': [1, 2, 2, 3, 1, 2, 3, 2]})
table2

   A  b
0  c  1
1  c  2
2  d  2
3  d  3
4  l  1
5  x  2
6  x  3
7  r  2

In [15]:
pd.merge(table1,table2,on=["A"],how='left')

    A  b_x  b_y
0   c    1  1.0
1   c    1  2.0
2   c    2  1.0
3   c    2  2.0
4   c    5  1.0
5   c    5  2.0
6   j    2  NaN
7   k    3  NaN
8   l    3  1.0
9   l    4  1.0
10  x    2  2.0
11  x    2  3.0
12  z    1  NaN

In [16]:
pd.merge(table1,table2,on=["A"],how='right')

    A  b_x  b_y
0   c  1.0    1
1   c  2.0    1
2   c  5.0    1
3   c  1.0    2
4   c  2.0    2
5   c  5.0    2
6   d  NaN    2
7   d  NaN    3
8   l  3.0    1
9   l  4.0    1
10  x  2.0    2
11  x  2.0    3
12  r  NaN    2

In [17]:
pd.merge(table1,table2,on=["A"],how='inner')

   A  b_x  b_y
0  c    1    1
1  c    1    2
2  c    2    1
3  c    2    2
4  c    5    1
5  c    5    2
6  l    3    1
7  l    4    1
8  x    2    2
9  x    2    3

In [18]:
"Shaurya Vashsith"[::-1]

'htishsaV ayruahS'

In [19]:
list_1 = [1,3,5,7,9]
list_2 = [2,4,6,8,10]
for i,k in zip(list_1,list_2):
    print(i,k)

1 2
3 4
5 6
7 8
9 10

In [20]:
list_1.append(11)
list_1

[1, 3, 5, 7, 9, 11]

In [21]:
list_1.pop()
list_1

[1, 3, 5, 7, 9]

In [22]:
list_2.insert(1,7)
list_2

[2, 7, 4, 6, 8, 10]

In [23]:
list_2.reverse()
list_2

[10, 8, 6, 4, 7, 2]

In [24]:
list_2.sort()
list_2

[2, 4, 6, 7, 8, 10]

In [1]:
## names that start with character "j"?
names= ["john", "fan", "sam", "megha", "popeye", "tom", "jane", "james","tony"]
print([name for name in names if name[0]=='j'])

['john', 'jane', 'james']

In [7]:
import pandas as pd
pd.DataFrame({'names':names})['names'].str.contains("to|ja|ha")

0    False
1    False
2    False
3     True
4    False
5     True
6     True
7     True
8     True
Name: names, dtype: bool

In [6]:
"shaurya".count('a')

2

In [7]:
dishes = ['soup','salad','sandwich','pasta']
combo = []

for i in range(len(dishes)):
    for j in range(i+1,len(dishes)):
        combo.append((dishes[i],dishes[j]))
combo

[('soup', 'salad'),
 ('soup', 'sandwich'),
 ('soup', 'pasta'),
 ('salad', 'sandwich'),
 ('salad', 'pasta'),
 ('sandwich', 'pasta')]

In [1]:
# Given a square matrix mat of size n x n. 
# The task is to rotate it by 90 degrees in an anti-clockwise direction without using any extra space.
mat = [[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]]
# Output: Rotated Matrix
# [[3, 6, 9],
# [2, 5, 8],
# [1, 4, 7]]

In [2]:
def rotate_90_anticlockwise(mat):
    n = len(mat)
    for i in range(n):
        for j in range(i + 1, n):
            mat[i][j], mat[j][i] = mat[j][i], mat[i][j]
    for i in range(n):
        mat[i].reverse()
mat = [[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]]
rotate_90_anticlockwise(mat)
mat

[[7, 4, 1], [8, 5, 2], [9, 6, 3]]